/*
 * 文件名称：mcu.c
 *
 * 文件说明：处理器驱动文件
 *
 */

#include "hal_clock.h"
#include "hal_mcu.h"

/********************************************
* Defines *
********************************************/ 




/********************************************
* Typedefs *
********************************************/



/********************************************
* Globals *
********************************************/


/********************************************
* Function *
********************************************/

void halMcuInit(void)
{
    clockSetMainSrc(CLOCK_SRC_XOSC);
}

void EnableInterrupts(void)
{
    HAL_INT_ON();
}

void DisableInterrupts(void)
{
    HAL_INT_OFF();
}
